# SelectAll

## Description
Procedure SelectAll selects all visible objects on the active layer of a VectorWorks document.

If Layer Options is set to Show-Snap-Modify Others, then SelectAll will select all visible objects within the document.

```pascal
PROCEDURE SelectAll;
```

```python
def vs.SelectAll():
    return None
```

## Version
Availability: from All Versions

## Category
* Selection